app/controllers/destinations_controller.rb

    def index
        destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"

    def show
        destination = Destination.find(params[:id])
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]