app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
    def index
        flights = Flight.all

INSERT INTO "flights" ("user_id", "destination_id", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?)  [["user_id", 12], ["destination_id", 5], ["created_at", "2019-10-01 18:34:14.853217"], ["updated_at", "2019-10-01 18:34:14.853217"], ["date", "2019-10-02"]]
---
    def create
        flight = Flight.create(flight_params)