app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Penny"], ["created_at", "2019-10-01 18:20:36.963025"], ["updated_at", "2019-10-01 18:20:36.963025"]]
---
    def create
        user = User.create(user_params)